# FabricationConfiguration Members (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
FabricationConfiguration Members
FabricationConfiguration Class Methods Properties See Also
---
The FabricationConfiguration type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AncillaryExists | Checks to see if the specified ancillary exists. |
| AreItemFilesLoaded | Checks if the fabrication item files have been loaded. |
| ArePhasesModifiable | Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.  (Inherited from Element.) |
| CanBeHidden | Indicates if the element can be hidden in the view. (Inherited from Element.) |
| CanBeLocked | Identifies if the element can be locked.  (Inherited from Element.) |
| CanBeSwapped | Checks if the fabrication configuration can be swapped. |
| CanDeleteSubelement | Checks if given subelement can be removed from the element.  (Inherited from Element.) |
| CanHaveTypeAssigned()()()() | Identifies if the element can have a type assigned.  (Inherited from Element.) |
| CanUnloadItemFiles | Checks if the fabrication item files are already in use and should not be unloaded. |
| ChangeTypeId(ElementId) | Changes the type of the element.  (Inherited from Element.) |
| CustomDataExists | Checks to see if the specified custom data exists. |
| DamperExists | Checks to see if the specified damper exists. |
| DeleteEntity | Deletes the existing entity created by %schema% in the element  (Inherited from Element.) |
| DeleteSubelement | Removes a subelement from the element.  (Inherited from Element.) |
| DeleteSubelements | Removes the subelements from the element.  (Inherited from Element.) |
| Dispose | (Inherited from Element.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetAllDampers | Gets all damper identifiers in the fabrication configuration. |
| GetAllFabricationConnectorDefinitions | Gets fabrication connector identifiers from the fabrication configuration, filtered by shape and domain. |
| GetAllInsulationSpecifications | Gets all insulation specification identifiers in the fabrication configuration. |
| GetAllLoadedItemFiles | Get list of all loaded fabrication item files. |
| GetAllLoadedServices | Returns all the loaded fabrication services. |
| GetAllMaterials | Gets all material identifiers in the fabrication configuration. |
| GetAllPartCustomData | Gets all possible fabrication part custom data identifiers. |
| GetAllPartStatuses | Gets all possible fabrication part status identifiers. |
| GetAllServices | Returns all fabrication services in the fabrication configuration. |
| GetAllSpecifications | Gets all specification identifiers in the fabrication configuration. |
| GetAllUsedItemFiles | Returns all the used fabrication item files. A fabrication item file is used if any fabrication parts in the model were created from it. |
| GetAllUsedServices | Returns all the used fabrication services. A service is used if any fabrication part in the service is created by user. |
| GetAncillaries | Gets fabrication ancillaries of the specified type. |
| GetAncillaryGroup | Gets the fabrication ancillary group of the specified fabrication ancillary identifier. |
| GetAncillaryGroupName | Gets the fabrication ancillary group and name for the specified fabrication ancillary identifier. |
| GetAncillaryName | Gets the fabrication ancillary name for the specified fabrication ancillary identifier. |
| GetDamperName | Gets the damper name from its identifier. |
| GetDependentElements | Get all elements that, from a logical point of view, are the children of this Element.  (Inherited from Element.) |
| GetEntity | Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.  (Inherited from Element.) |
| GetEntitySchemaGuids | Returns the Schema guids of any Entities stored in this element.  (Inherited from Element.) |
| GetExternalFileReference | Gets information pertaining to the external file referenced by the element.  (Inherited from Element.) |
| GetExternalResourceReference | Gets the ExternalResourceReference associated with a specified external resource type.  (Inherited from Element.) |
| GetExternalResourceReferenceExpanded | Gets the collection of ExternalResourceReference associated with a specified external resource type.  (Inherited from Element.) |
| GetExternalResourceReferences | Gets the map of the external resource references referenced by the element.  (Inherited from Element.) |
| GetExternalResourceReferencesExpanded | Gets the expanded map of the external resource references referenced by the element.  (Inherited from Element.) |
| GetFabricationConfiguration | Gets the fabrication configuration element in the document. |
| GetFabricationConfigurationInfo | Gets the information about the fabrication configuration of the project. |
| GetFabricationConnectorDomain | Gets the fabrication connector domain from its identifier. |
| GetFabricationConnectorGroup | Gets the fabrication connector group from its identifier. |
| GetFabricationConnectorName | Gets the fabrication connector name from its identifier. |
| GetFabricationConnectorShape | Gets the fabrication connector shape from its identifier. |
| GetGeneratingElementIds | Returns the ids of the element(s) that generated the input geometry object.  (Inherited from Element.) |
| GetGeometryObjectFromReference | Retrieve one geometric primitive contained in the element given a reference.  (Inherited from Element.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetInsulationSpecificationAbbreviation | Gets insulation specification abbreviation. |
| GetInsulationSpecificationGroup | Gets the insulation specification group from its identifier. |
| GetInsulationSpecificationName | Gets the insulation specification name from its identifier. |
| GetItemFolders | Gets a list of every fabrication item folder in the fabrication item folder structure. |
| GetMaterialAbbreviation | Gets the abreviation of the material or the insulation or the double wall material. |
| GetMaterialArea | Gets the area of the material with the given id.  (Inherited from Element.) |
| GetMaterialGroup | Gets material group from its identifier. |
| GetMaterialIds | Gets the element ids of all materials present in the element.  (Inherited from Element.) |
| GetMaterialName | Gets material name from its identifier. |
| GetMaterialVolume | Gets the volume of the material with the given id.  (Inherited from Element.) |
| GetMonitoredLinkElementIds | Provides the link instance IDs when the element is monitoring.  (Inherited from Element.) |
| GetMonitoredLocalElementIds | Provides the local element IDs when the element is monitoring.  (Inherited from Element.) |
| GetOrderedParameters | Gets the parameters associated to the element in order.  (Inherited from Element.) |
| GetParameter | Retrieves a parameter from the element given identifier. (Inherited from Element.) |
| GetParameterFormatOptions | Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.  (Inherited from Element.) |
| GetParameters | Retrieves the parameters from the element via the given name. (Inherited from Element.) |
| GetPartCustomDataName | Gets the custom data name from its identifier. |
| GetPartCustomDataType | Gets the custom data type from its identifier. See FabricationCustomDataType enumerator. |
| GetPartStatusDescription | Gets the status description from its identifier. |
| GetPhaseStatus | Gets the status of a given element in the input phase  (Inherited from Element.) |
| GetProfile | Return the profile of the loaded fabrication configuration. Return empty string for global profile. |
| GetService | Get the service based on the service identifier from the fabrication configuration in the current document. |
| GetServiceTypeName | Gets the service type name. |
| GetSpecificationAbbreviation | Gets specification abreviation. |
| GetSpecificationGroup | Gets the specification group from its identifier. |
| GetSpecificationName | Gets the specification name from its identifier. |
| GetSubelements | Returns the collection of element subelements.  (Inherited from Element.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| GetTypeId | Returns the identifier of this element's type.  (Inherited from Element.) |
| GetValidTypes()()()() | Obtains a set of types that are valid for this element.  (Inherited from Element.) |
| HasPhases | Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.  (Inherited from Element.) |
| HasValidConfiguration | Checks whether a valid fabrication configuration has been set for the project. |
| IsAncillaryKit | Gets whether the specified fabrication ancillary identifier is an ancillary kit or not. |
| IsCreatedPhaseOrderValid | Returns true if createdPhaseId and demolishedPhaseId are in order.  (Inherited from Element.) |
| IsDemolishedPhaseOrderValid | Returns true if createdPhaseId and demolishedPhaseId are in order.  (Inherited from Element.) |
| IsExternalFileReference | Determines whether this Element represents an external file.  (Inherited from Element.) |
| IsHidden | Identifies if the element has been permanently hidden in the view. (Inherited from Element.) |
| IsMonitoringLinkElement | Indicate whether an element is monitoring any elements in any linked models.  (Inherited from Element.) |
| IsMonitoringLocalElement | Indicate whether an element is monitoring other local elements.  (Inherited from Element.) |
| IsPhaseCreatedValid | Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.  (Inherited from Element.) |
| IsPhaseDemolishedValid | Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.  (Inherited from Element.) |
| IsValidType(ElementId) | Checks if given type is valid for this element.  (Inherited from Element.) |
| LoadItemFiles | Loads the specified fabrication item files into the project. |
| LoadServices | Loads the specified fabrication services into the project. |
| LocateFabricationConnector | Gets the fabrication connector identifiers by group and name, filtered by shape and domain. |
| LocateInsulationSpecification | Gets the insulation specification by group and name. |
| LocateMaterial | Gets material by group and name. |
| LocateSpecification | Gets the specification identifier by group and name. |
| LookupParameter | Attempts to find a parameter on the element which has the given name. (Inherited from Element.) |
| RefersToExternalResourceReference | Determines whether this Element uses external resources associated with a specified external resource type.  (Inherited from Element.) |
| RefersToExternalResourceReferences | Determines whether this Element uses external resources.  (Inherited from Element.) |
| ReloadConfiguration | Reloads the fabrication configuration from its source fabrication configuration. |
| SetConfiguration(FabricationConfigurationInfo) | Set the fabrication configuration with global profile. |
| SetConfiguration(FabricationConfigurationInfo, String) | Set the fabrication configuration with specific profile. |
| SetEntity | Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.  (Inherited from Element.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |
| UnloadItemFiles | Unload the specified fabrication item files from the project. |
| UnloadServices | Unload the specified fabrication services from the project. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AssemblyInstanceId | The id of the assembly instance to which the element belongs.  (Inherited from Element.) |
| BoundingBox | Retrieves a box that circumscribes all geometry of the element. (Inherited from Element.) |
| Category | Retrieves a Category object that represents the category or sub category in which the element resides. (Inherited from Element.) |
| CreatedPhaseId | Id of a Phase at which the Element was created.  (Inherited from Element.) |
| DemolishedPhaseId | Id of a Phase at which the Element was demolished.  (Inherited from Element.) |
| DesignOption | Returns the design option to which the element belongs. (Inherited from Element.) |
| Document | Returns the Document in which the Element resides. (Inherited from Element.) |
| Geometry | Retrieves the geometric representation of the element. (Inherited from Element.) |
| GroupId | The id of the group to which an element belongs.  (Inherited from Element.) |
| Id | A unique identifier for an Element in an Autodesk Revit project.  (Inherited from Element.) |
| IsModifiable | Identifies if the element is modifiable.  (Inherited from Element.) |
| IsTransient | Indicates whether an element is transient or permanent.  (Inherited from Element.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from Element.) |
| LevelId | The id of the level associated with the element.  (Inherited from Element.) |
| Location | This property is used to find the physical location of an element within a project. (Inherited from Element.) |
| Name | A human readable name for the Element. (Inherited from Element.) |
| OwnerViewId | The id of the view that owns the element.  (Inherited from Element.) |
| [Parameter[([( Guid])]) ](2e852bc4-46c6-5598-cc45-0eaf38cf8973.md "Parameter Property \(Guid\)") | Retrieves a parameter from the element given a GUID for a shared parameter. (Inherited from Element.) |
| [Parameter[([( BuiltInParameter])]) ](2f91a9f3-7f69-72f9-08d6-a2d71dfb33db.md "Parameter Property \(BuiltInParameter\)") | Retrieves a parameter from the element given a parameter id. (Inherited from Element.) |
| [Parameter[([( Definition])]) ](87d8a88c-906e-85a9-f575-f263788b8584.md "Parameter Property \(Definition\)") | Retrieves a parameter from the element based on its definition. (Inherited from Element.) |
| Parameters | Retrieves a set containing all of the parameters that are contained within the element. (Inherited from Element.) |
| ParametersMap | Retrieves a map containing all of the parameters that are contained within the element. (Inherited from Element.) |
| Pinned | Identifies if the element has been pinned to prevent changes.  (Inherited from Element.) |
| UniqueId | A stable unique identifier for an element within the document.  (Inherited from Element.) |
| VersionGuid | Get the element version Guid.  (Inherited from Element.) |
| ViewSpecific | Identifies if the element is owned by a view.  (Inherited from Element.) |
| WorksetId | Get Id of the Workset which owns the element.  (Inherited from Element.) |

# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace